<?

// http://jazzmyomyo.dothome.co.kr/jazzmyomyo/delivery_sample_insert.php


include_once('./header.php');

    $SQL = "INSERT INTO `delivery_table` (`userId`,`recipient`, `deliveryHp`, `deliveryDefault`, `deliveryRequest`, `zipCode`, `deliveryaddress1`, `deliveryaddress2`, `wDate`, `wUpdate`,`memo`, `deliveryDel`) 
    
    VALUES
    ('myomyotest','김묘묘','010-1234-5678', 1, '부재시 문앞에 놓아주세요', '08288', '서울 구로구 새말로 97 (구로동)', '6층', '2025-07-31 21:00:00', '2025-07-31 21:00:00','집', 0),
    ('vinocat','남준호',   '010-9898-2323', 1, '부재시 문앞에 놓아주세요', '30023', '세종특별자치시 조치원읍 건강길 25', '1층', '2025-07-30 21:00:00', '2025-07-31 21:00:00','회사', 0),
    ('myomyo','이묘묘','010-1234-5678', 1, '부재시 문앞에 놓아주세요', '04621', '서울 중구 남산공원길 372 (장충동2가)', '1층', '2025-07-15 21:00:00', '2025-07-31 21:00:00','회사', 0),
    ('jazzman','박재즈','010-1111-2222', 1, '부재시 문앞에 놓아주세요', '04044', '서울 마포구 독막로3길 13 (서교동)', '301호', '2025-07-28 21:00:00', '2025-07-31 21:00:00','집', 0),
    ('drumbeat','윤드럼','010-3333-1212', 1, '부재시 문앞에 놓아주세요', '28451', '충북 청주시 흥덕구 과상미로 16 (봉명동)', '102호', '2025-07-28 21:00:00', '2025-07-31 21:00:00','기타', 0),
    ('winequeen','이와인','010-3333-4444', 1, '부재시 문앞에 놓아주세요', '21994', '인천 연수구 신송로82번길 6 (송도동, 송도풍림아이원4단지아파트)', '101동 704호', '2025-08-01 21:00:00', '2025-07-31 21:00:00','집', 0),
    ('pianista','최피아','010-9090-8080', 1, '부재시 문앞에 놓아주세요', '48095', '부산 해운대구 구남로 9 (우동)', '2층', '2025-08-11 21:00:00', '2025-07-31 21:00:00','집', 0),
    ('guitarcat','홍기타','010-5555-6666', 1, '부재시 문앞에 놓아주세요', '42009', '대구 수성구 국채보상로 804 (범어동)', '202호', '2025-08-15 21:00:00', '2025-07-31 21:00:00','집', 0)
            ";

    $RES = mysqli_query($CONN, $SQL);
    
    if($RES){
        echo 1; // 성공 메시지 숫자 1
    }
    else{
        echo 0; // 실패 메시지 숫자 0
    }
?>