<?

// http://jazzmyomyo.dothome.co.kr/jazzmyomyo/order_sample_insert.php

//1. DB접속 열기
include_once('./header.php');

//2. 테이블에 저장할 데이터

    $SQL = "INSERT INTO `order_table` 
            (`userId`, `userName`, `userHp`, `orderType`, `productId`, `productName`, `quantity`, `price`, `payMethod`, `shippingAddress`, `orderDate`, `orderUpdate`, `orderStatus`, `orderDel`) 
            VALUES
            ('myomyotest', '김묘묘', '010-1234-5678', 'MD', 'product_coster_01', 'LP 코스터 세트', 2, 29800, '무통장입금', '08288 서울 구로구 새말로 97 (구로동) 6층', '2025-06-30', '2025-06-30', '배송완료', 0),
            ('vinocat', '남준호', '010-9898-2323', 'MD', 'product_mugcup_01', '블랙 머그컵', 4, 31600, '무통장입금', '30023 세종특별자치시 조치원읍 건강길 25 1층', '2025-07-04', '2025-07-04', '배송완료', 0),
            ('myomyo', '이묘묘', '010-1234-5678', 'MD', 'product_keyring_01', '재즈 묘묘 키링[3type]', 1, 10000, '무통장입금', '04621 서울 중구 남산공원길 372 (장충동2가) 1층', '2025-07-12', '2025-07-14', '주문취소', 0),
            ('jazzman', '박재즈', '010-1111-2222', 'MD', 'product_doll_01', '블랙 묘묘 인형 (30cm) [2type] - 전신 묘묘', 1, 32200, '무통장입금', '04044 서울 마포구 독막로3길 13 (서교동) 301호', '2025-07-14', '2025-07-14', '배송완료', 0),
            ('drumbeat', '윤드럼', '010-3333-1212', 'MD', 'product_doll_01', '블랙 묘묘 인형 (30cm) [2type] - 앉은 묘묘', 1, 32200, '무통장입금', '28451 충북 청주시 흥덕구 과상미로 16 (봉명동) 102호', '2025-07-19', '2025-07-19', '배송완료', 0),
            ('winequeen', '이와인', '010-3333-4444', 'MD', 'product_pouch_01', '블랙 묘묘 파우치', 2, 24000, '무통장입금', '21994 인천 연수구 신송로82번길 6 (송도동, 송도풍림아이원4단지아파트) 101동 704호', '2025-07-20', '2025-07-25', '교환', 0),
            ('pianista', '최피아', '010-9090-8080', 'MD', 'product_lighter_01', '블랙 라이터', 1, 8000, '무통장입금', '48095 부산 해운대구 구남로 9 (우동) 2층', '2025-07-25', '2025-07-25', '배송완료', 0),
            ('guitarcat', '홍기타', '010-5555-6666', 'MD', 'product_coster_01', 'LP 코스터 세트', 2, 29800, '무통장입금', '42009 대구 수성구 국채보상로 804 (범어동) 202호', '2025-08-02', '2025-08-02', '주문취소', 0),
            ('bassline', '오베이스', '010-5656-7878', 'MD', 'product_doll_01', '블랙 묘묘 인형 (30cm) [2type] - 전신 묘묘', 1, 32200, '무통장입금', '44717 울산 남구 갈밭로 4 (삼산동) 1층', '2025-08-03', '2025-08-04', '주문취소', 0),
            ('myomyotest', '김묘묘', '010-1234-5678', 'MD', 'product_CD_01', 'Colde (콜드) - Love Part 2', 1, 26000, '무통장입금', '08288 서울 구로구 새말로 97 (구로동) 6층', '2025-08-04', '2025-08-04', '배송완료', 0),
            ('vinocat', '남준호', '010-9898-2323', 'MD', 'product_CD_04', '잭킹콩(JKC) - 2집 : Apophenia', 1, 23800, '무통장입금', '30023 세종특별자치시 조치원읍 건강길 25 1층', '2025-08-05', '2025-08-05', '주문취소', 0),
            ('myomyo', '이묘묘', '010-1234-5678', 'MD', 'product_coster_01', 'LP 코스터 세트', 3, 44700, '무통장입금', '04621 서울 중구 남산공원길 372 (장충동2가) 1층', '2025-08-06', '2025-08-06', '배송완료', 0),
            ('jazzman', '박재즈', '010-1111-2222', 'MD', 'product_ballcap_01', '재즈 묘묘 로고 볼캡 [2colors] - 와인', 0, 0, '무통장입금', '04044 서울 마포구 독막로3길 13 (서교동) 301호', '2025-08-10', '2025-08-17', '환불', 0),
            ('drumbeat', '윤드럼', '010-3333-1212', 'MD', 'product_CD_05', '잭킹콩(JKC) - 1집 Dress code', 1, 23800, '무통장입금', '28451 충북 청주시 흥덕구 과상미로 16 (봉명동) 102호', '2025-08-12', '2025-08-12', '배송완료', 0),
            ('winequeen', '이와인', '010-3333-4444', 'MD', 'product_doll_01', '블랙 묘묘 인형 (30cm) [2type] - 앉은 묘묘', 1, 32200, '무통장입금', '21994 인천 연수구 신송로82번길 6 (송도동, 송도풍림아이원4단지아파트) 101동 704호', '2025-08-07', '2025-08-07', '배송완료', 0),
            ('pianista', '최피아', '010-9090-8080', 'MD', 'product_LP_01', '최백호 - 찰나(刹那) ver.2', 1, 66700, '무통장입금', '48095 부산 해운대구 구남로 9 (우동) 2층', '2025-08-14', '2025-08-14', '배송완료', 0),
            ('guitarcat', '홍기타', '010-5555-6666', 'MD', 'product_doll_01', '블랙 묘묘 인형 (30cm) [2type] - 앉은 묘묘', 1, 32200, '무통장입금', '42009 대구 수성구 국채보상로 804 (범어동) 202호', '2025-08-15', '2025-08-15', '배송완료', 0),
            ('bassline', '오베이스', '010-5656-7878', 'MD', 'product_LP_02', '죠지 - 1집 FRR', 1, 60490, '무통장입금', '44717 울산 남구 갈밭로 4 (삼산동) 1층', '2025-08-17', '2025-08-17', '배송완료', 0),
            ('myomyotest', '김묘묘', '010-1234-5678', 'MD', 'product_doll_01', '블랙 묘묘 인형 (30cm) [2type] - 앉은 묘묘', 1, 32200, '무통장입금', '08288 서울 구로구 새말로 97 (구로동) 6층', '2025-08-20', '2025-08-20', '결제대기', 0),
            ('myomyotest', '김묘묘', '010-1234-5678', 'MD', 'product_LP_04', 'Lauv(라우브) - 2집 All 4 Nothing', 1, 59100, '무통장입금', '08288 서울 구로구 새말로 97 (구로동) 6층', '2025-08-24', '2025-08-24', '결제대기', 0);
            ";

    $RES = mysqli_query($CONN, $SQL);
    
    if($RES){
        echo 1; // 성공 메시지 숫자 1
    }
    else{
        echo 0; // 실패 메시지 숫자 0
    }
    
?>